clusterMHDTest/ShockTUBE-Ryu/2a/HLLC-L/0/pB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [0.5 0.5 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet-outlet
    {
        type            zeroGradient;
    }
    top-down
    {
        type            empty;
    }
    front-back
    {
        type            empty;
    }
}


// ************************************************************************* //
