clusterMHDTest/ShockTUBE-Ryu/2a/HLLC-L/system/funkySetFieldsDict
FoamFile
{
    version         2.0;
    format          ascii;


    instance        "system";
    local           "";

    class           dictionary;
    object          funkySetFieldsDict;
}


expressions
(


	regiao_1
	{
		field U;
		expression "vector(0,0,0)";
              condition "pos().x >0.5";
 
	}

	regiao_2
	{
		field U;
		expression "vector(1.2,0.01,0.5)";
              condition "pos().x <=0.5";
 
	}

	regiao_1
	{
		field p;
		expression "1";
              condition "pos().x >0.5";
 
	}

	regiao_2
	{
		field p;
		expression "0.95";
              condition "pos().x <=0.5";
 
	}

	regiao_1
	{
		field T;
		expression "0.5";
              condition "pos().x >0.5";
 
	}

	regiao_2
	{
		field T;
		expression "0.439814815";
              condition "pos().x <=0.5";
 
	}


	regiao_1
	{
		field B;
	       expression "vector(0.564189584,1.128379167,0.564189584)";
              condition "pos().x >0.5";
 
	}

	regiao_2
	{
		field B;
		expression "vector(0.564189584,1.01554125,0.564189584)";
              condition "pos().x <=0.5";
 
	}


	);


